In [1]:
import pandas as pd

In [3]:
dfmelt=pd.read_csv(r"C:\Users\User\Downloads\DATASETS\Melt\meltdb.csv")

In [4]:
dfmelt

    WeekDays  Hyderabad  Delhi  Vizag  Chennai
0     Monday         35     34     38       39
1    Tuesday         36     32     37       38
2  Wednesday         33     31     35       37
3   Thursday         35     33     36       38
4     Friday         38     35     38       37
5   Saturday         37     32     37       35
6     Sunday         35     33     35       36

In [5]:
pd.melt(dfmelt)

     variable      value
0    WeekDays     Monday
1    WeekDays    Tuesday
2    WeekDays  Wednesday
3    WeekDays   Thursday
4    WeekDays     Friday
5    WeekDays   Saturday
6    WeekDays     Sunday
7   Hyderabad         35
8   Hyderabad         36
9   Hyderabad         33
10  Hyderabad         35
11  Hyderabad         38
12  Hyderabad         37
13  Hyderabad         35
14      Delhi         34
15      Delhi         32
16      Delhi         31
17      Delhi         33
18      Delhi         35
19      Delhi         32
20      Delhi         33
21      Vizag         38
22      Vizag         37
23      Vizag         35
24      Vizag         36
25      Vizag         38
26      Vizag         37
27      Vizag         35
28    Chennai         39
29    Chennai         38
30    Chennai         37
31    Chennai         38
32    Chennai         37
33    Chennai         35
34    Chennai         36

In [8]:
df2=pd.melt(dfmelt,id_vars=['WeekDays'])

In [9]:
dfprof=pd.read_csv(r"C:\Users\User\Downloads\DATASETS\Cond Dataset\resume.csv")

In [10]:
dfprof["Full Name"]

0        Arjun Yadav
1        Akash Reddy
2     Shanti Narayan
3        Meena Arjun
4        Naren Yadav
5        Shiva Kumar
6    Srikanth Sharma
7         Aman Pandi
8      Narayan Reddy
Name: Full Name, dtype: object

In [11]:
dfprof["Full Name"].str.split(" ")

0        [Arjun, Yadav]
1        [Akash, Reddy]
2     [Shanti, Narayan]
3        [Meena, Arjun]
4        [Naren, Yadav]
5        [Shiva, Kumar]
6    [Srikanth, Sharma]
7         [Aman, Pandi]
8      [Narayan, Reddy]
Name: Full Name, dtype: object

In [26]:
d=dfprof["Full Name"].str.split(" ", expand=True).columns =["FName","LName"]

In [27]:
d

['FName', 'LName']

In [22]:
dfprof["Full Name"].map(lambda x : x.split())

0        [Arjun, Yadav]
1        [Akash, Reddy]
2     [Shanti, Narayan]
3        [Meena, Arjun]
4        [Naren, Yadav]
5        [Shiva, Kumar]
6    [Srikanth, Sharma]
7         [Aman, Pandi]
8      [Narayan, Reddy]
Name: Full Name, dtype: object

In [30]:
dfprof["Full Name"].map(lambda x: x.upper())

0        ARJUN YADAV
1        AKASH REDDY
2     SHANTI NARAYAN
3        MEENA ARJUN
4        NAREN YADAV
5        SHIVA KUMAR
6    SRIKANTH SHARMA
7         AMAN PANDI
8      NARAYAN REDDY
Name: Full Name, dtype: object

In [31]:
dfprof["Full Name"].map(lambda x: x.lower())

0        arjun yadav
1        akash reddy
2     shanti narayan
3        meena arjun
4        naren yadav
5        shiva kumar
6    srikanth sharma
7         aman pandi
8      narayan reddy
Name: Full Name, dtype: object

In [44]:
dfprof[dfprof["Full Name"].str.startswith("S")]

         Full Name          City State                 Technology
2   Shanti Narayan  Secunderabad    TS       JavaPythonOraclePerl
5      Shiva Kumar     Hyderabad    TS  PythonJavaScriptPerlMongo
6  Srikanth Sharma  Secunderabad    TS        JavaRubyPerlAngular

In [39]:
dfprof

         Full Name          City  State                     Technology
0      Arjun Yadav     Hyderabad     TS       JavaPythonJavaScriptPerl
1      Akash Reddy       Chennai     TN         JavaRubyJavaScriptPerl
2   Shanti Narayan  Secunderabad     TS           JavaPythonOraclePerl
3      Meena Arjun        Bhopal     MP      JuliaPythonJavaScriptPerl
4      Naren Yadav         Delhi  Delhi  JavaPythonJavaScriptSqlserver
5      Shiva Kumar     Hyderabad     TS      PythonJavaScriptPerlMongo
6  Srikanth Sharma  Secunderabad     TS            JavaRubyPerlAngular
7       Aman Pandi        Bhopal     MP          AngularHtmlPerlOracle
8    Narayan Reddy       Chennai     TN         PythonOracleDjangoRuby

In [43]:
dfprof[dfprof["State"]=="MP"]

     Full Name    City State                 Technology
3  Meena Arjun  Bhopal    MP  JuliaPythonJavaScriptPerl
7   Aman Pandi  Bhopal    MP      AngularHtmlPerlOracle

In [45]:
dfprof["Technology"]

0         JavaPythonJavaScriptPerl
1           JavaRubyJavaScriptPerl
2             JavaPythonOraclePerl
3        JuliaPythonJavaScriptPerl
4    JavaPythonJavaScriptSqlserver
5        PythonJavaScriptPerlMongo
6              JavaRubyPerlAngular
7            AngularHtmlPerlOracle
8           PythonOracleDjangoRuby
Name: Technology, dtype: object